results/node/hyper-express.txt
Bundle: 247.9 KB
Startup: 56.6 ms
Memory before: 71.3 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    124977.04    7470.54  139743.24
  Latency        4.00ms     1.37ms   133.28ms
  HTTP codes:
    1xx - 0, 2xx - 1250206, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    19.67MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    115916.77    7152.09  126390.52
  Latency        4.31ms     1.42ms   115.14ms
  HTTP codes:
    1xx - 0, 2xx - 1159544, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    22.77MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    101120.08    6612.94  115102.16
  Latency        4.94ms   533.00us    38.68ms
  HTTP codes:
    1xx - 0, 2xx - 1011486, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    27.38MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       344.54     158.08     646.21
  Latency       29.06ms     2.30ms    48.72ms
  HTTP codes:
    1xx - 0, 2xx - 3449, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     4.53GB/s

Memory after: 274.1 MB