results/node/koa.txt
Bundle: 728.6 KB
Startup: 55.2 ms
Memory before: 86.8 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     58867.57    6911.10   66634.89
  Latency        8.49ms    28.18ms      2.00s
  HTTP codes:
    1xx - 0, 2xx - 588975, 3xx - 0, 4xx - 0, 5xx - 0
    others - 26
  Errors:
    dial tcp 127.0.0.1:3000: i/o timeout - 26
  Throughput:    12.74MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     57046.12    3483.06   62814.20
  Latency        8.76ms    26.95ms      2.08s
  HTTP codes:
    1xx - 0, 2xx - 570913, 3xx - 0, 4xx - 0, 5xx - 0
    others - 8
  Errors:
    dial tcp 127.0.0.1:3000: i/o timeout - 8
  Throughput:    14.58MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     48106.57    8365.42   53739.57
  Latency       10.47ms    26.92ms      2.07s
  HTTP codes:
    1xx - 0, 2xx - 477635, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    15.06MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       325.85     142.44     535.64
  Latency       30.70ms     2.05ms    49.08ms
  HTTP codes:
    1xx - 0, 2xx - 3260, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     4.29GB/s

Memory after: 345.4 MB