results/node/nest.txt
Bundle: 1.3 MB
Startup: 103.5 ms
Memory before: 100.1 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     36309.11    3578.74   40747.28
  Latency       13.76ms    46.44ms      2.32s
  HTTP codes:
    1xx - 0, 2xx - 363502, 3xx - 0, 4xx - 0, 5xx - 0
    others - 89
  Errors:
    dial tcp 127.0.0.1:3000: i/o timeout - 89
  Throughput:    10.07MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     33174.84    3542.62   37979.90
  Latency       15.06ms    49.78ms      2.38s
  HTTP codes:
    1xx - 0, 2xx - 332123, 3xx - 0, 4xx - 0, 5xx - 0
    others - 104
  Errors:
    dial tcp 127.0.0.1:3000: i/o timeout - 104
  Throughput:     9.77MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     32644.11    2391.59   37047.38
  Latency       15.30ms    53.43ms      2.38s
  HTTP codes:
    1xx - 0, 2xx - 326740, 3xx - 0, 4xx - 0, 5xx - 0
    others - 105
  Errors:
    dial tcp 127.0.0.1:3000: i/o timeout - 105
  Throughput:    12.48MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       330.08     159.46     550.52
  Latency       30.28ms     1.75ms    46.49ms
  HTTP codes:
    1xx - 0, 2xx - 3309, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     4.35GB/s

Memory after: 361.2 MB