results/node/routing-controllers.txt
Bundle: 1.7 MB
Startup: 165.9 ms
Memory before: 105.8 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     41515.69    1975.22   46467.91
  Latency       12.04ms    41.65ms      2.23s
  HTTP codes:
    1xx - 0, 2xx - 415468, 3xx - 0, 4xx - 0, 5xx - 0
    others - 70
  Errors:
    dial tcp 127.0.0.1:3000: i/o timeout - 70
  Throughput:    11.52MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     37951.53    1428.62   41191.66
  Latency       13.16ms    41.64ms      2.38s
  HTTP codes:
    1xx - 0, 2xx - 379928, 3xx - 0, 4xx - 0, 5xx - 0
    others - 53
  Errors:
    dial tcp 127.0.0.1:3000: i/o timeout - 53
  Throughput:    11.18MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     34315.60    1677.12   39503.05
  Latency       14.56ms    49.92ms      2.34s
  HTTP codes:
    1xx - 0, 2xx - 343494, 3xx - 0, 4xx - 0, 5xx - 0
    others - 96
  Errors:
    dial tcp 127.0.0.1:3000: i/o timeout - 96
  Throughput:    12.95MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       328.15     143.54     526.45
  Latency       30.47ms     1.76ms    44.98ms
  HTTP codes:
    1xx - 0, 2xx - 3290, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     4.33GB/s

Memory after: 357.0 MB