results/node/ultimate-express.txt
Bundle: 584.4 KB
Startup: 66.3 ms
Memory before: 92.3 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    169157.12    5779.71  187792.49
  Latency        2.95ms     1.12ms   128.18ms
  HTTP codes:
    1xx - 0, 2xx - 1691717, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    32.10MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    101362.23    6456.76  111575.34
  Latency        4.93ms   731.69us    79.98ms
  HTTP codes:
    1xx - 0, 2xx - 1013794, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    26.00MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     92176.46   10785.02  117620.82
  Latency        5.42ms   614.84us    71.44ms
  HTTP codes:
    1xx - 0, 2xx - 922093, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    29.18MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       482.48      80.84     767.25
  Latency       20.74ms     1.45ms    31.24ms
  HTTP codes:
    1xx - 0, 2xx - 4828, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     6.35GB/s

Memory after: 425.7 MB