results/node/uws.txt
Bundle: 3.0 KB
Startup: 41.9 ms
Memory before: 61.9 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    169407.02    4057.86  189447.36
  Latency        2.95ms   256.16us    36.99ms
  HTTP codes:
    1xx - 0, 2xx - 1694226, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    29.40MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    165135.71    5389.45  197474.87
  Latency        3.03ms   832.94us    87.23ms
  HTTP codes:
    1xx - 0, 2xx - 1651610, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    39.68MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    134390.65    5853.74  176129.55
  Latency        3.72ms   446.96us    47.36ms
  HTTP codes:
    1xx - 0, 2xx - 1344352, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    36.66MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       383.52     127.35     724.37
  Latency       26.06ms     1.18ms    32.13ms
  HTTP codes:
    1xx - 0, 2xx - 3840, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     5.06GB/s

Memory after: 203.8 MB